# 수업 준비
# 1. 구글 밋업 (https://meet.google.com/wqu-ofee-sva)
# 2. VScode LiveShare 링크 공유
# 3. 과제


# 데이터 위주로 활용연습
# 프로그래밍언어 5가지 체크
# 1. 데이터
# 2. 조건문
# 3. 반복문
# 4. 함수
# 5. 클래스


# 1. 출력함수
# print("출력할 내용")

print("hello world")

# 2. 변수 : 데이터를 저장하는 공간(메모리)
# - 변수이름 = 데이터
# 파이썬의 변수명 코드 스타일 공식문서 (https://peps.python.org/pep-0008/)
# - 숫자 시작 안되고
# - snack_case 소문자로,"_"

today= "2025-01-23"
print(today)


# 파이썬은 생각보다 관대하다.
# 데이터타입(=자료형)
# 1. 숫자타입 Number
# - int() : 정수타입
# - float() : 소수타입
# - +, -, *, /, **(제곱),%(나머지), //(몫)


