# 숫자, 문자, bool, 리스트
# 조건문 반복문


# 합계 = 누적합계

# 과목을 평균을 구하기 
# 전체 과목의 합 /갯수

# A 4.0
# B 3.0
# c 2.0
# d 1.0
# f 0

# grade = [4.5, 3.5, 3.0, 1.0, 3.5, 1.5, 3.0]
# 인덱스   0     1    2    3   4    5    6

# sum1=0

#for문 횟수 - 리스트의 길이만큼 반복하면 모든 리스트의 값을 뽑을 수가 있다. 
# for i in range(len(grade)):
#     print(g)
# print(grade)

# 인덱싱 : 리스트 값을 뽑기
# 변수이름[인덱스]

# for문 : 횟수로 반복을 많이 합니다.
# - 반복할때마다 바뀌는 값 : 반복변수 i (0~횟수-1까지)
# for i in range(len(grade)):
    # print(i)
    # i는 리스트의 인덱스로 활용할수있다.
    # print(grade[i])
    # sum1+=grade[i]
    # += : 더해서 저장하다
    # -= *= /= %=
    # sum1 = sum1+ grade[1]

    # print("grade 요소값 : 성적")
# print(sum1)


# 과제:

# 주어진 데이터에서 용도가 "secret"이면서 샌서값이 "error"가 난 층수을 출력해주세요.
# 건물에 대한 데이터
# p 데이터는 건물에 용도 s:건물에 센서에 대한 데이터

p = ['general', 'office', 'office', 'general', 'office', 'general', 'office', 'office', 'office', 'secret', 'conference', 'conference', 'office', 'general', 'office', 'general', 'secret', 'office', 'general', 'secret', 'general', 'office', 'office', 'general', 'office', 'conference', 'office', 'office', 'office', 'conference', 'conference', 'conference', 'office', 'general', 'secret', 'general', 'office', 'secret', 'general', 'office']
s = ['error', 'error', '054057', '054324', '054326', '054327', 'error', 'error', '054345', '054352', '054353', '054359', '054404', '054406', '054411', '054412', '054413', '054414', 'error', 'error', '054415', '054416', 'error', 'error', 'error', 'error', '054421', '054422', 'error', 'error', '054425', '054426', '054427', '054428' , '054429', '054430', '054431', '054432', '054433', '054434']

for i in range(len(p)):
    if p[i]=='secret' and s[i]=='error':
        print(f"{(i+1)}층 입니다.")

# ////////////////////////////////////////////////////////////////////////////////////////////////////////

# 2번문제)각 호수의 면적을 저장한 리스트입니다. 총 면적을 구해주세요.
r = [24,24,35,32,8,27,23,35,19,19,18,22,23,19,22,22,22,18,22,30,30,23,22,30,30,23,23,28,25,20,23,30,18]

tot=0

for i in range(len(r)):
    tot+=r[i]
print(f"면적: {tot}")

# ////////////////////////////////////////////////////////////////////////////////////////////////////////

# 2번문제 리스트를 보고 23미만의 호수를 구해주세요.
# 2-2) 배열=리스트
# (1)빈리스트하나 생성해주기

lst=[]
for i in range(len(r)):
    if r[i]<23:
        # 정답을 찾을때마다, 정답리스트 추가해주시면됩니다.
        # 리스트변수.append(추가할데이터)
        #print(r[i])
        lst.append(r[i])
print(lst)
# // 한줄로 => 여러개의 데이터를 하나로 다루고싶다 => 배열(=리스트)

# ////////////////////////////////////////////////////////////////////////////////////////////////////////

# 2번문제 리스트를 보고 23미만의 호수의 면적을 구해주세요.
# 2-3
tot=0
for i in range(len(r)):
    if r[i]<23:
        tot+=r[i]
print(f"호수의 면적: {tot}")

# ////////////////////////////////////////////////////////////////////////////////////////////////////////

# 3. 주어진진 데이터의 평균을 구해주세요.
lst = [10,20,30,40,50,60,70,80,90]
tot=0
for i in range(len(lst)):
    tot+=lst[i]
avg=tot/len(lst)
print(f"data avg: {avg}")
# // 소수점

# ////////////////////////////////////////////////////////////////////////////////////////////////////////

# 4. 1~50까지 숫자중에서 3의 배수가 아닌것들의 합을 구해주세요.
tot=0
for i in range(1,50):
    if i%3!=0:
        tot+=i
print(f"sum: {tot}")
